Repository: tiann/hapi
Catalog: ios/Hapi/Resources/Localizable.xcstrings
Source language: en
Languages: ru, zh_hans

source: %@ Open a session chat to browse its files.
ru: %@ Откройте чат сессии, чтобы просмотреть её файлы.
zh_hans: %@ 打开会话聊天即可浏览其文件。

source: %@ (%lld edits)
ru: %@ (правки: %lld)
zh_hans: %@（%lld 处编辑）

source: %@ (+%lld more)
ru: %@ (+ещё %lld)
zh_hans: %@（另有 %lld 个）

source: %@ (optional)
ru: %@ (необязательно)
zh_hans: %@（可选）

source: %@ is over the 50 MB upload limit
ru: %@ превышает лимит загрузки 50 МБ
zh_hans: %@ 超过 50 MB 上传上限

source: %@ log
ru: Журнал %@
zh_hans: %@ 日志

source: %@ rejected its stored credentials and was signed out. Pair it again from the hub menu.
ru: %@ отклонил сохранённые учётные данные, и устройство вышло из аккаунта. Сопрягите его заново из меню хаба.
zh_hans: %@ 拒绝了已保存的凭据，已退出登录。请从 Hub 菜单重新配对。

source: %@ tokens · %lld req · in %@ / out %@
ru: Токены: %@ · запросов: %lld · вход %@ / выход %@
zh_hans: %@ Token · %lld 次请求 · 输入 %@ / 输出 %@

# %@ · %@ requests
source: %1$@ · %2$@ requests
ru: %@ · %@ запросов

source: %@ · %lld requests
ru: %@ · запросы: %lld
zh_hans: %@ · %lld 项

source: %@, %lld sessions
ru: %@, %lld сессий
zh_hans: %@，%lld 个会话

source: %lld Questions
ru: Вопросы: %lld
zh_hans: %lld 个问题

source: %lld agent steps
ru: %lld шага агента
zh_hans: %lld 个代理步骤

source: %lld attachments
ru: %lld вложений
zh_hans: %lld 个附件

source: %lld chars
ru: Символы: %lld
zh_hans: %lld 个字符

source: %lld commands
ru: %lld команды
zh_hans: %lld 条命令

source: %lld edits
ru: Правки: %lld
zh_hans: %lld 次修改

source: %lld failed tools
ru: Сбойные инструменты: %lld
zh_hans: %lld 个工具失败

source: %lld findings
ru: Замечания: %lld
zh_hans: %lld 条发现

source: %lld lines
ru: Строки: %lld
zh_hans: %lld 行

source: %lld new messages ↓
ru: %lld новых сообщения ↓
zh_hans: %lld 条新消息 ↓

source: %lld notes
ru: Заметки: %lld
zh_hans: %lld 条笔记

source: %lld other tools
ru: Другие инструменты: %lld
zh_hans: %lld 个其他工具

source: %lld queued messages
ru: Сообщения в очереди: %lld
zh_hans: %lld 条排队消息

source: %lld reads
ru: %lld чтения
zh_hans: %lld 次读取

source: %lld requests · in %@ · out %@
ru: Запросы: %lld · вход %@ · выход %@
zh_hans: %lld 次请求 · 输入 %@ · 输出 %@

source: %lld searches
ru: %lld поиска
zh_hans: %lld 次搜索

source: %lld sessions
ru: %lld сессий
zh_hans: %lld 个会话

source: %lld staged · %lld unstaged
ru: %lld в индексе · %lld вне индекса
zh_hans: %lld 个已暂存 · %lld 个未暂存

source: %lld tool calls
ru: Вызовы инструментов: %lld
zh_hans: %lld 次工具调用

source: %lld tools
ru: Инструменты: %lld
zh_hans: %lld 个工具

source: %lld web requests
ru: Веб-запросы: %lld
zh_hans: %lld 次网络请求

source: (empty)
ru: (пусто)
zh_hans: （空）

source: 0 tokens
ru: 0 токенов
zh_hans: 0 Token

source: 1 agent step
ru: 1 шаг агента
zh_hans: 1 个代理步骤

source: 1 command
ru: 1 команда
zh_hans: 1 条命令

source: 1 edit
ru: 1 правка
zh_hans: 1 次修改

source: 1 finding
ru: 1 замечание
zh_hans: 1 条发现

source: 1 new message ↓
ru: 1 новое сообщение ↓
zh_hans: 1 条新消息 ↓

source: 1 note
ru: 1 заметка
zh_hans: 1 条笔记

source: 1 other tool
ru: 1 другой инструмент
zh_hans: 1 个其他工具

source: 1 queued message
ru: 1 сообщение в очереди
zh_hans: 1 条排队消息

source: 1 read
ru: 1 чтение
zh_hans: 1 次读取

source: 1 search
ru: 1 поиск
zh_hans: 1 次搜索

source: 1 tool
ru: 1 инструмент
zh_hans: 1 个工具

source: 1 tool call
ru: 1 вызов инструмента
zh_hans: 1 次工具调用

source: 1 web request
ru: 1 веб-запрос
zh_hans: 1 次网络请求

source: 30 days
ru: 30 дней
zh_hans: 近 30 天

source: 7 days
ru: 7 дней
zh_hans: 近 7 天

source: A note can hold at most %lld attachments
ru: Максимум вложений в заметке: %lld
zh_hans: 每条笔记最多 %lld 个附件

source: Abort
ru: Прервать
zh_hans: 中止

source: About
ru: О программе
zh_hans: 关于

source: Access token
ru: Токен доступа
zh_hans: 访问令牌

source: Action failed
ru: Действие не выполнено
zh_hans: 操作失败

source: Active
ru: Активна
zh_hans: 活跃

source: Add Hub
ru: Добавить хаб
zh_hans: 添加 Hub

source: Add Hub…
ru: Добавить хаб…
zh_hans: 添加 Hub…

source: Add a note…
ru: Добавить примечание…
zh_hans: 添加备注…

source: Add another hub
ru: Добавить ещё хаб
zh_hans: 添加另一个 Hub

source: Add attachment
ru: Добавить вложение
zh_hans: 添加附件

source: Add photo
ru: Добавить фото
zh_hans: 添加照片

source: Add to send queue
ru: Добавить в очередь отправки
zh_hans: 加入发送队列

source: After
ru: После
zh_hans: 修改后

source: Agent
ru: Агент
zh_hans: 代理

source: Agent Mode
ru: Режим агента
zh_hans: 代理模式

source: Agent process
ru: Процесс агента
zh_hans: 子代理执行过程

source: Agent: %@
ru: Агент: %@
zh_hans: 代理：%@

source: All
ru: Все
zh_hans: 全部

source: All Machines
ru: Все машины
zh_hans: 所有机器

source: All time
ru: За всё время
zh_hans: 全部时间

source: Allow
ru: Разрешить
zh_hans: 允许

source: Allow all edits
ru: Разрешить все правки
zh_hans: 允许所有编辑

source: Allow camera access in Settings to scan the pairing QR, or go back and use manual entry.
ru: Разрешите доступ к камере в Настройках, чтобы сканировать QR для сопряжения, или вернитесь и введите данные вручную.
zh_hans: 请在「设置」中允许访问相机以扫描配对二维码，或返回使用手动输入。

source: Allow for this session
ru: Разрешить для этой сессии
zh_hans: 本会话允许

source: Already delivered to the agent
ru: Уже доставлено агенту
zh_hans: 已送达智能体

source: Already handled elsewhere
ru: Уже обработано в другом месте
zh_hans: 已在其他位置处理

source: Already handled elsewhere.
ru: Уже обработано в другом месте.
zh_hans: 已在其他设备上处理。

source: Already paired with %@ — switched to it.
ru: Уже сопряжено с %@ — переключились на него.
zh_hans: 已与 %@ 配对 — 已切换过去。

source: Already queued — couldn't remove the draft. Retry removal only.
ru: Уже в очереди — не удалось удалить черновик. Повторите только удаление.
zh_hans: 已加入队列，但草稿移除失败。请重试移除，不会重复发送。

source: Answer every question first
ru: Сначала ответьте на все вопросы
zh_hans: 请先回答所有问题

source: Answer every required question first
ru: Сначала ответьте на все обязательные вопросы
zh_hans: 请先回答所有必答问题

source: Answered
ru: Отвечено
zh_hans: 已回答

source: Answers
ru: Ответы
zh_hans: 答案

source: App language
ru: Язык приложения
zh_hans: 应用语言

source: App version
ru: Версия приложения
zh_hans: 应用版本

source: Appearance
ru: Оформление
zh_hans: 外观

source: Append to input
ru: Добавить к вводу
zh_hans: 追加到输入

source: Applies after the app is relaunched.
ru: Применится после перезапуска приложения.
zh_hans: 重新启动应用后生效。

source: Apply changes
ru: Применить изменения
zh_hans: 应用变更

source: Applying changes…
ru: Применение изменений…
zh_hans: 正在应用更改…

source: Archive
ru: Архивировать
zh_hans: 归档

source: Archive failed: %@
ru: Не удалось архивировать: %@
zh_hans: 归档失败：%@

source: Attach
ru: Прикрепить
zh_hans: 添加附件

source: Attachment only
ru: Только вложение
zh_hans: 仅附件

source: Attachments are still uploading — wait, or retry/remove the failed ones
ru: Вложения ещё загружаются — подождите либо повторите или удалите неудачные
zh_hans: 附件仍在上传 — 请稍候，或重试/移除失败的附件

source: Audio recording failed
ru: Ошибка записи звука
zh_hans: 录音失败

source: Awaiting approval
ru: Ожидает одобрения
zh_hans: 等待审批

source: Awaiting response
ru: Ожидание ответа
zh_hans: 等待回答

source: Back to chat
ru: Назад в чат
zh_hans: 返回聊天

source: Back to latest
ru: К последним
zh_hans: 回到最新

source: Background task
ru: Фоновая задача
zh_hans: 后台任务

source: Before
ru: До
zh_hans: 修改前

source: Beginning of conversation
ru: Начало разговора
zh_hans: 已到会话起点

source: Binary file not shown
ru: Двоичный файл не показан
zh_hans: 二进制文件未显示

source: Binary file — no preview available
ru: Двоичный файл — предпросмотр недоступен
zh_hans: 二进制文件 — 无法预览

source: Broadcast
ru: Широковещание
zh_hans: 广播

source: Browse
ru: Обзор
zh_hans: 浏览

source: By agent
ru: По агентам
zh_hans: 按 Agent

source: By model
ru: По моделям
zh_hans: 按模型

source: Bypass approvals and sandbox
ru: Обойти подтверждения и песочницу
zh_hans: 跳过审批和沙箱

source: Cache creation
ru: Создание кеша
zh_hans: 缓存创建

source: Cache hit rate
ru: Доля попаданий в кеш
zh_hans: 缓存命中率

source: Cache read
ru: Чтение кеша
zh_hans: 缓存命中

source: Camera
ru: Камера
zh_hans: 相机

source: Camera access denied
ru: Доступ к камере запрещён
zh_hans: 相机权限被拒绝

source: Cancel
ru: Отмена
zh_hans: 取消

source: Changes
ru: Изменения
zh_hans: 变更

source: Chat
ru: Чат
zh_hans: 聊天

source: Check the connection to your hub and try again.
ru: Проверьте подключение к хабу и попробуйте снова.
zh_hans: 请检查与 Hub 的连接后重试。

source: Check the hub address. HTTPS is recommended, for example https://hub.example.com.
ru: Проверьте адрес хаба. Рекомендуется HTTPS, например https://hub.example.com.
zh_hans: 请检查 Hub 地址。建议使用 HTTPS，例如 https://hub.example.com。

source: Checking directory…
ru: Проверка каталога…
zh_hans: 正在检查目录…

source: Checking hub…
ru: Проверка хаба…
zh_hans: 正在检查 Hub…

source: Checking installed Agents…
ru: Проверка установленных агентов…
zh_hans: 正在检查已安装的代理…

source: Choose a session from the sidebar, or start a new one.
ru: Выберите сессию на боковой панели или создайте новую.
zh_hans: 从侧栏选择一个会话，或新建会话。

source: Choose Directory
ru: Выбрать каталог
zh_hans: 选择目录

source: Clear Filters
ru: Сбросить фильтры
zh_hans: 清除筛选

source: Close
ru: Закрыть
zh_hans: 关闭

source: Close agent
ru: Закрыть агента
zh_hans: 关闭代理

source: Close details to approve or answer in the conversation.
ru: Закройте детали, чтобы одобрить или ответить в разговоре.
zh_hans: 关闭详情后，可在对话中审批或回答。

source: Code review
ru: Ревью кода

source: Collaboration Mode
ru: Режим совместной работы
zh_hans: 协作模式

source: Collapsed
ru: Свёрнуто
zh_hans: 已折叠

source: Completed
ru: Завершено
zh_hans: 已完成

source: Connecting…
ru: Подключение…
zh_hans: 连接中…

source: Connection protocol
ru: Протокол подключения
zh_hans: 连接协议

source: Connection: %@
ru: Подключение: %@
zh_hans: 连接状态：%@

source: Continue command
ru: Продолжить команду
zh_hans: 继续命令

source: Continue loading history
ru: Продолжить загрузку истории
zh_hans: 继续加载历史

source: Continue planning
ru: Продолжить планирование
zh_hans: 继续规划

source: Copy
ru: Копировать
zh_hans: 复制

source: Copy Contents
ru: Копировать содержимое
zh_hans: 复制文件内容

source: Copy Path
ru: Копировать путь
zh_hans: 复制路径

source: Copy full content
ru: Копировать всё содержимое
zh_hans: 复制完整内容

source: Copy input
ru: Копировать ввод
zh_hans: 复制输入

source: Copy result
ru: Копировать результат
zh_hans: 复制结果

source: Copy text
ru: Копировать текст
zh_hans: 复制文字

source: Could not load this dashboard.
ru: Не удалось загрузить эту панель.
zh_hans: 无法加载此看板。

source: Could not reach the hub
ru: Не удалось связаться с хабом
zh_hans: 无法连接 Hub

source: Could not reach your hub. Open HAPI to respond.
ru: Не удалось связаться с вашим хабом. Откройте HAPI, чтобы ответить.
zh_hans: 无法连接 Hub。请打开 HAPI 进行回应。

source: Could not save
ru: Не удалось сохранить
zh_hans: 无法保存

source: Could not start recording
ru: Не удалось начать запись
zh_hans: 无法开始录音

source: Could not store the push key.
ru: Не удалось сохранить ключ push-уведомлений.
zh_hans: 无法保存推送密钥。

source: Couldn't attach the file — check the hub connection
ru: Не удалось прикрепить файл — проверьте подключение к хабу
zh_hans: 无法附加文件 — 请检查 Hub 连接

source: Couldn't delete the note — check the hub connection
ru: Не удалось удалить заметку — проверьте подключение к хабу
zh_hans: 无法删除笔记 — 请检查 Hub 连接

source: Couldn't load history. Tap to retry.
ru: Не удалось загрузить историю. Нажмите, чтобы повторить.
zh_hans: 历史加载失败，点此重试

source: Couldn't load the scratchlist
ru: Не удалось загрузить заметки
zh_hans: 无法加载草稿夹

source: Couldn't load this session
ru: Не удалось загрузить эту сессию
zh_hans: 无法加载此会话

source: Couldn't park the draft — check the hub connection
ru: Не удалось отложить черновик — проверьте подключение к хабу
zh_hans: 无法暂存草稿 — 请检查 Hub 连接

source: Couldn't prepare the attachments — retry or remove the failed files
ru: Не удалось подготовить вложения — повторите или удалите неудачные файлы
zh_hans: 附件准备失败，请重试或移除失败的附件

source: Couldn't queue the draft — retry
ru: Не удалось поставить черновик в очередь — повторите
zh_hans: 草稿加入队列失败，请重试

source: Couldn't read %@
ru: Не удалось прочитать %@
zh_hans: 无法读取 %@

source: Couldn't read the selected photo
ru: Не удалось прочитать выбранное фото
zh_hans: 无法读取所选照片

source: Couldn't read the selected video
ru: Не удалось прочитать выбранное видео
zh_hans: 无法读取所选视频

source: Couldn't refresh — showing saved drafts
ru: Не удалось обновить — показаны сохранённые черновики
zh_hans: 刷新失败，正在显示已缓存的草稿

source: Couldn't remove the attachment — check the hub connection
ru: Не удалось убрать вложение — проверьте подключение к хабу
zh_hans: 无法移除附件 — 请检查 Hub 连接

source: Couldn't save the draft — your changes are kept here
ru: Не удалось сохранить черновик — ваши изменения остались здесь
zh_hans: 保存失败，修改仍保留在这里，请重试

source: Couldn't save the note — check the hub connection
ru: Не удалось сохранить заметку — проверьте подключение к хабу
zh_hans: 无法保存笔记 — 请检查 Hub 连接

source: Create
ru: Создать
zh_hans: 创建

source: Create Team
ru: Создать команду
zh_hans: 创建团队

source: Create a new git worktree next to the repo
ru: Создать новый git worktree рядом с репозиторием
zh_hans: 在仓库旁创建新的 git 工作树

source: Create and Make Directory
ru: Создать и создать каталог
zh_hans: 创建并新建目录

source: Creating…
ru: Создание…
zh_hans: 创建中…

source: Current Directory
ru: Текущий каталог
zh_hans: 当前目录

source: Custom answer
ru: Свой ответ
zh_hans: 自定义答案

source: Daily tokens
ru: Токены по дням
zh_hans: 每日 Token

source: Dark
ru: Тёмная
zh_hans: 深色

source: Database
ru: База данных
zh_hans: 数据库

source: Default
ru: По умолчанию
zh_hans: 默认

source: Delete
ru: Удалить
zh_hans: 删除

source: Delete Team
ru: Удалить команду
zh_hans: 删除团队

source: Delete this draft?
ru: Удалить этот черновик?
zh_hans: 删除这条草稿？

source: Delivery outcome unknown
ru: Результат доставки неизвестен
zh_hans: 发送结果未知

source: Denied
ru: Отклонено
zh_hans: 已拒绝

source: Deny
ru: Отклонить
zh_hans: 拒绝

source: Detached HEAD
ru: Отсоединённый HEAD
zh_hans: 游离 HEAD

source: Details
ru: Подробности
zh_hans: 详情

source: Dictate
ru: Диктовать
zh_hans: 语音输入

source: Diff
ru: Диф

source: Directory
ru: Каталог
zh_hans: 目录

source: Directory does not exist. Creating the session will create it automatically.
ru: Каталог не существует. При создании сессии он будет создан автоматически.
zh_hans: 目录不存在，创建会话时将自动创建。

source: Directory does not exist. Tap Create again to create it automatically.
ru: Каталог не существует. Нажмите «Создать» ещё раз, чтобы создать его автоматически.
zh_hans: 目录不存在。再次点按「创建」将自动新建该目录。

source: Directory must be inside one of this machine's workspace roots.
ru: Каталог должен находиться внутри одного из корней рабочего пространства этой машины.
zh_hans: 目录必须位于此机器配置的某个工作区根目录内。

source: Discard changes
ru: Отменить изменения
zh_hans: 放弃修改

source: Discard your changes?
ru: Отменить ваши изменения?
zh_hans: 放弃尚未保存的修改？

source: Disk footprint of the hub's SQLite database (database, write-ahead log, shared memory).
ru: Место на диске, занимаемое базой SQLite хаба (база, журнал упреждающей записи, общая память).
zh_hans: Hub SQLite 数据库的磁盘占用（数据库、预写日志、共享内存）。

source: Dismiss
ru: Закрыть
zh_hans: 关闭

source: Domain or IP address
ru: Домен или IP-адрес
zh_hans: 域名或 IP 地址

source: Done
ru: Готово
zh_hans: 完成

source: Draft
ru: Черновик
zh_hans: 草稿

source: Draft actions
ru: Действия с черновиком
zh_hans: 草稿操作

source: Draft added to the send queue
ru: Черновик добавлен в очередь отправки
zh_hans: 草稿已加入发送队列

source: Draft no longer available
ru: Черновик больше недоступен
zh_hans: 这条草稿已不存在

source: Draft parked to scratchlist
ru: Черновик отложен в заметки
zh_hans: 草稿已存入草稿夹

source: Draft text
ru: Текст черновика
zh_hans: 草稿内容

source: Drafts can contain at most 10,000 characters — shorten the text before saving
ru: Черновик может содержать не более 10 000 символов — сократите текст перед сохранением
zh_hans: 草稿最多支持 10,000 个字符，请缩短内容后再暂存

source: Earlier calls aren't loaded. Close this view and load older messages in the conversation.
ru: Более ранние вызовы не загружены. Закройте этот просмотр и загрузите старые сообщения в разговоре.
zh_hans: 更早的工具调用尚未加载。请关闭此视图，在对话中加载更早的消息。

source: Edit
ru: Изменить
zh_hans: 编辑

source: Edit %lld/%lld
ru: Правка %lld/%lld
zh_hans: 编辑 %lld/%lld

source: Edit draft
ru: Редактировать черновик
zh_hans: 编辑草稿

source: Edit file
ru: Правка файла
zh_hans: 编辑文件

source: Edit note
ru: Редактировать заметку
zh_hans: 编辑笔记

source: Edit notebook
ru: Правка блокнота
zh_hans: 编辑笔记本

source: Effort
ru: Усилие
zh_hans: 思考强度

source: Enable in system settings…
ru: Включить в системных настройках…
zh_hans: 在系统设置中开启…

source: Enabled
ru: Включено
zh_hans: 已开启

source: Enter Hub Details
ru: Введите данные хаба
zh_hans: 输入 Hub 信息

source: Enter Manually
ru: Ввести вручную
zh_hans: 手动输入

source: Enter a valid hub domain or IP address, with an optional port.
ru: Введите корректный домен или IP-адрес хаба, при необходимости с портом.
zh_hans: 请输入有效的 Hub 域名或 IP 地址，可包含端口。

source: Enter the access token printed by your hub.
ru: Введите токен доступа, напечатанный вашим хабом.
zh_hans: 请输入 Hub 启动时显示的访问令牌。

source: Enter your hub address without the protocol, or paste a full URL or pairing link.
ru: Введите адрес хаба без протокола либо вставьте полный URL или ссылку для сопряжения.
zh_hans: 输入 Hub 地址，无需填写协议；也可粘贴完整地址或配对链接。

source: Error
ru: Ошибка
zh_hans: 错误

source: Expanded
ru: Развёрнуто
zh_hans: 已展开

source: Failed to abort
ru: Не удалось прервать
zh_hans: 中止失败

source: Failed to browse directories
ru: Не удалось просмотреть каталоги
zh_hans: 浏览目录失败

source: Failed to cancel queued message
ru: Не удалось отменить сообщение в очереди
zh_hans: 取消排队消息失败

source: Failed to check directory
ru: Не удалось проверить каталог
zh_hans: 无法检查目录

source: Failed to check installed Agents
ru: Не удалось проверить установленных агентов
zh_hans: 检查已安装代理失败

source: Failed to create session
ru: Не удалось создать сессию
zh_hans: 创建会话失败

source: Failed to list directory
ru: Не удалось получить список каталога
zh_hans: 加载目录失败

source: Failed to load Codex models
ru: Не удалось загрузить модели Codex
zh_hans: 加载 Codex 模型失败

source: Failed to load diff
ru: Не удалось загрузить диф
zh_hans: 加载 Diff 失败

source: Failed to load models
ru: Не удалось загрузить модели
zh_hans: 加载模型失败

source: Failed to load models: %@
ru: Не удалось загрузить модели: %@
zh_hans: 加载模型失败：%@

source: Failed to load older messages
ru: Не удалось загрузить старые сообщения
zh_hans: 加载更早消息失败

source: Failed to read file
ru: Не удалось прочитать файл
zh_hans: 读取文件失败

source: Failed to search files
ru: Не удалось выполнить поиск файлов
zh_hans: 搜索文件失败

source: Failed to steer message
ru: Не удалось направить сообщение
zh_hans: 插入消息失败

source: Failed to synchronize messages
ru: Не удалось синхронизировать сообщения
zh_hans: 同步消息失败

source: Failed to update session
ru: Не удалось обновить сессию
zh_hans: 更新会话失败

source: Failed — tap to retry
ru: Ошибка — нажмите, чтобы повторить
zh_hans: 失败 — 点按重试

source: Fast
ru: Быстрый
zh_hans: 快速

source: Fast Mode
ru: Быстрый режим
zh_hans: 快速模式

source: Fetching the session list from the hub.
ru: Получение списка сессий с хаба.
zh_hans: 正在从 Hub 获取会话列表。

source: File
ru: Файл
zh_hans: 文件

source: File actions
ru: Действия с файлом
zh_hans: 文件操作

source: Files
ru: Файлы
zh_hans: 文件

source: Filters
ru: Фильтры
zh_hans: 筛选

source: Follow system
ru: Как в системе
zh_hans: 跟随系统

source: Full message
ru: Сообщение целиком
zh_hans: 完整消息

source: Git status unavailable
ru: Статус Git недоступен
zh_hans: Git 状态不可用

source: Git status unavailable for this session
ru: Статус Git недоступен для этой сессии
zh_hans: 此会话的 Git 状态不可用

source: HAPI is self-hosted: your agent sessions run on your own machine, served by a hub you operate. Start the hub on your computer, then pair this app with the QR code it prints — or enter the hub URL and access token by hand.
ru: HAPI размещается самостоятельно: ваши сессии агентов работают на вашей машине за хабом, которым управляете вы. Запустите хаб на компьютере, затем сопрягите это приложение по QR-коду, который он печатает, либо введите URL хаба и токен доступа вручную.
zh_hans: HAPI 是自托管的：你的智能体会话运行在你自己的机器上，由你自己运营的 Hub 提供服务。先在电脑上启动 Hub，然后用它打印的二维码配对本应用 — 也可以手动输入 Hub 地址和访问令牌。

source: HTTP is unencrypted and may be restricted by iOS. HTTPS is recommended.
ru: HTTP не шифруется и может блокироваться iOS. Рекомендуется HTTPS.
zh_hans: HTTP 不加密，且可能受 iOS 网络策略限制。建议使用 HTTPS。

source: Held — not sent
ru: Удержано — не отправлено
zh_hans: 暂存 · 未发送

source: Hide note
ru: Скрыть примечание
zh_hans: 收起备注

source: High risk
ru: Высокий риск
zh_hans: 高风险

source: Hub
ru: Хаб

source: Hub URL
ru: URL хаба
zh_hans: Hub 地址

source: Hub already paired
ru: Хаб уже сопряжён
zh_hans: Hub 已配对

source: Hub database size on disk
ru: Размер базы данных хаба на диске
zh_hans: Hub 数据库磁盘占用

source: Hub error
ru: Ошибка хаба
zh_hans: Hub 错误

source: Hub unreachable
ru: Хаб недоступен
zh_hans: 无法连接 Hub

source: Hub unreachable — tap to retry.
ru: Хаб недоступен — нажмите, чтобы повторить.
zh_hans: 无法连接 Hub — 点按重试。

source: Hubs
ru: Хабы
zh_hans: Hub

source: Image is too large even after compression
ru: Изображение слишком большое даже после сжатия
zh_hans: 图片压缩后仍然过大

source: Implement plan
ru: Реализовать план
zh_hans: 执行计划

source: Inactive
ru: Неактивна
zh_hans: 未活跃

source: Input
ru: Ввод
zh_hans: 输入

source: Insights
ru: Аналитика
zh_hans: 统计

source: Inspecting task log
ru: Просмотр журнала задачи
zh_hans: 查看任务日志

source: Interrupt agent
ru: Прервать агента
zh_hans: 中断代理

source: Invalid hub URL
ru: Неверный URL хаба
zh_hans: Hub 地址无效

source: Keep an instruction for later…
ru: Сохранить инструкцию на потом…
zh_hans: 记下稍后要做的事…

source: Keep editing
ru: Продолжить редактирование
zh_hans: 继续编辑

source: Language
ru: Язык
zh_hans: 语言

source: Latest tool
ru: Последний инструмент
zh_hans: 最新工具

source: Launch Agent
ru: Запуск агента
zh_hans: 启动代理

source: Light
ru: Светлая
zh_hans: 浅色

source: Line %lld
ru: Строка %lld
zh_hans: 第 %lld 行

source: List agents
ru: Список агентов
zh_hans: 列出代理

source: List files
ru: Список файлов
zh_hans: 列出文件

source: Live
ru: Онлайн
zh_hans: 实时

source: Live updates interrupted — reconnecting…
ru: Живые обновления прерваны — переподключение…
zh_hans: 实时更新已中断 — 正在重连…

source: Load more content
ru: Загрузить больше
zh_hans: 加载更多内容

source: Load older messages
ru: Загрузить старые сообщения
zh_hans: 加载更早消息

source: Loading machines…
ru: Загрузка машин…
zh_hans: 加载机器…

source: Loading messages…
ru: Загрузка сообщений…
zh_hans: 加载消息…

source: Loading models…
ru: Загрузка моделей…
zh_hans: 加载模型中…

source: Loading older messages…
ru: Загрузка старых сообщений…
zh_hans: 加载更早消息…

source: Loading sessions…
ru: Загрузка сессий…
zh_hans: 正在加载会话…

source: Loading…
ru: Загрузка…
zh_hans: 加载中…

source: Machine
ru: Машина
zh_hans: 机器

source: Machine · %@
ru: Машина · %@
zh_hans: 机器 · %@

source: Machine: %@
ru: Машина: %@
zh_hans: 机器：%@

source: Managed by agent
ru: Управляется агентом
zh_hans: 由代理管理

source: Message
ru: Сообщение
zh_hans: 消息

source: Message agent
ru: Сообщение агенту
zh_hans: 发消息给代理

source: Message cancelled — kept your current draft
ru: Сообщение отменено — текущий черновик сохранён
zh_hans: 消息已取消 — 已保留当前草稿

source: Message the agent…
ru: Сообщение агенту…
zh_hans: 输入消息…

source: Message: %@
ru: Сообщение: %@
zh_hans: 消息：%@

source: Messages will appear here as the agent works.
ru: Сообщения появятся здесь по мере работы агента.
zh_hans: 智能体工作时，消息会显示在这里。

source: Microphone access is disabled — allow it in Settings to dictate
ru: Доступ к микрофону отключён — разрешите его в Настройках для диктовки
zh_hans: 麦克风权限已被禁用 — 请在「设置」中允许后再使用语音输入

source: Microphone permission is needed for dictation
ru: Для диктовки нужен доступ к микрофону
zh_hans: 语音输入需要麦克风权限

source: Model
ru: Модель
zh_hans: 模型

source: Model list unavailable for this session.
ru: Список моделей недоступен для этой сессии.
zh_hans: 此会话暂无可用模型列表。

source: More approval options
ru: Больше вариантов одобрения
zh_hans: 更多授权选项
